[
  {
    "_id": "643d0453b8fece631c0bfe5e",
    "key": "bio",
    "paragraphs": [
      "Aaron Static, born in Port Hedland, Australia, is an exceptionally talented electronic music producer and DJ who has been captivating audiences for years. Initially drawn to electronic music through Perth's University Radio Station 'RTRFM' in the late 1990s, he developed a passion for early genres like Jungle, Drum & Bass, Hardcore, UK Garage, Progressive Breaks and Trance. Aaron quickly gained a reputation for his own productions and DJ sets around Perth in the Rave scene, often performing Drum n Bass \"Live PA\" gigs with his 486 DX2-80. Many hard drives succumbed to the bass vibrations at huge events around Perth organized by MFI and others.",
      "After many years in the Perth scene, including early Tech-Step Drum & Bass releases on Argon Records and Neurofunk on his own Kinematic320 imprint with Rregula (now part of Zombie Cats), Aaron moved to Melbourne in 2006. His sound has diversified extensively, blending elements from Techno, Tech House, Deep House, Breaks, and Dubstep in his productions. He launched his debut album, \"Singularity,\" in 2009, exploring themes of the coming AI singularity and its impacts on society. A diverse and varied album that shifted away from his DnB roots into new territories and BPMs.",
      "Aaron's music career continued to flourish, with his next album \"Redemption\" showcasing his versatility in various electronic genres like Chillstep, Future Garage and Autonomic Drum & Bass. The album received vast global recognition via YouTube channels including MrSuicideSheep and MOR Chillstep among others with hugely successful tracks like \"Amen Tune\", \"Severance\", \"Intrepid Journey\" and \"I Won't\".",
      "In late 2019 just before the pandemic hit Aaron released his most seminal album to date. \"Shifting Tides\" focused on finding an escape from the chaos of the modern world through beautiful and relaxing music, resonating with listeners worldwide. His Future Garage single \"When We Love\" on Slime Recordings gained immense popularity, with almost 2 million plays on Spotify and counting.",
      "After \"Shifting Tides\" Aaron has made a triumphant return back to his Drum & Bass roots with a number of successful releases on Melbourne labels onesevenfour and Delight as well as recently taking up the reigns of Shadowhearts Recordings where he plans to present the world with his vision of a Drum & Bass with equal parts darkness and lightness reminiscent of the 1990s label that was his greatest influence growing up; Moving Shadow."
    ],
    "photos": [
      "aaronstatic_1.jpg",
      "aaronstatic_2.jpg"
    ]
  },
  {
    "_id": "643d07a6b8fece631c0bfe5f",
    "key": "music",
    "paragraphs": [
      "Welcome to the official Aaron Static music releases page, where you can explore the diverse and captivating discography of this talented electronic music producer. Discover his journey through a range of genres, from House, Progressive House, and Techno in his debut album \"Singularity\" to Chillstep, Future Garage, and Autonomic Drum & Bass in later works like \"Redemption\" and \"Shifting Tides.\" Aaron Static is known for his emotive melodies, intricate soundscapes, and thought-provoking themes, which have touched the hearts of fans around the world. Dive into his singles, such as the soulful \"Spread My Wings\" and the melodic \"I'll Know,\" or explore his collaborative projects like \"Looking Good EP\" with Australian artist Artsea. Browse through Aaron Static's impressive collection of albums, singles, and remixes, and immerse yourself in the world of his unforgettable music.",
      "Click on any release to see more information including tracklists and lyrics."
    ]
  },
  {
    "_id": "643d496bb8fece631c0bfe68",
    "paragraphs": [
      "Welcome to the official website of Aaron Static, an Australian music artist and app developer known for his diverse and captivating music. Explore his innovative blend of Ambient, Liquid Drum & Bass, Organic House, Future Garage, and more. Discover his latest releases, albums, and singles while experiencing the passion and creativity that drive his unique sound."
    ],
    "key": "intro"
  },
  {
    "_id": "643e5a7bb8fece631c0bfe71",
    "key": "mixes",
    "paragraphs": [
      "Welcome to the 'Mixes' page, where you can immerse yourself in Aaron Static's live DJ sets, recorded straight from the dancefloor. Experience the energy and atmosphere of his performances as he masterfully blends genres and takes you on a sonic journey through his eclectic music selection. From intimate club gigs to larger festival stages, these mixes capture the essence of Aaron Static's unique style and undeniable talent behind the decks. "
    ]
  },
  {
    "_id": "643fdce5b8fece631c0bfe7a",
    "key": "projects",
    "paragraphs": [
      "Explore Aaron Static's various projects created in his spare time in a variety of programming languages. He is dedicated to making tools which help musicians and producers be more creative and musical in their work, and also has a passion for video game design and modding."
    ]
  }
]